IRP/src/Catalogs/ConfigurationMetadata/ConfigurationMetadata.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>ConfigurationMetadata</name>
 <hierarchical>true</hierarchical>
 <hierarchyType>HierarchyOfItems</hierarchyType>
 <predefined>
  <items>
   <name>Catalogs</name>
   <description>Catalogs</description>
  </items>
  <items>
   <name>Documents</name>
   <description>Documents</description>
  </items>
  <items>
   <name>Reports</name>
   <description>Reports</description>
  </items>
  <items>
   <name>DataProcessors</name>
   <description>Data processors</description>
  </items>
 </predefined>
 <attributes>
  <name>Extension</name>
  <type>
   <types>CatalogRef.Extensions</types>
  </type>
 </attributes>
 <attributes>
  <name>CheckDescriptionDuplicate</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>CheckDescriptionFilling</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>ObjectName</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>64</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>ObjectFullName</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>128</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>Unused</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>ELedgerShortDescription</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>20</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>ELedgerLongDescription</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>20</length>
   </stringQualifiers>
  </type>
 </attributes>
 <tabularSections>
  <name>ImportantAttributes</name>
  <attributes>
   <name>TabularName</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>100</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>AttributeName</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>100</length>
    </stringQualifiers>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>NotAuditAttributes</name>
  <attributes>
   <name>TabularName</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>100</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>AttributeName</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>100</length>
    </stringQualifiers>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>ReadOnlyAttributes</name>
  <attributes>
   <name>TabularName</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>100</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>AttributeName</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>100</length>
    </stringQualifiers>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>HiddenAttributes</name>
  <attributes>
   <name>TabularName</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>100</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>AttributeName</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>100</length>
    </stringQualifiers>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/InformationRegisters/ObjectsPrintTemplates/ObjectsPrintTemplates.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ObjectsPrintTemplates</name>
  <dimensions>
    <name>Object</name>
    <type>
      <types>CatalogRef.ConfigurationMetadata</types>
    </type>
  </dimensions>
  <dimensions>
    <name>PrintTemplate</name>
    <type>
      <types>CatalogRef.PrintFormTemplates</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

IRP/src/Catalogs/ConfigurationMetadata/Forms/ItemForm/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	CatalogsServer.OnCreateAtServerObject(ThisObject, Object, Cancel, StandardProcessing);
	If Object.Parent <> Catalogs.ConfigurationMetadata.Documents Then
		Items.ELedgerLongDescription.Visible = False;
		Items.ELedgerShortDescription.Visible = False;
	EndIf;
EndProcedure

&AtServer
Procedure OnReadAtServer(CurrentObject)
	
	Query = New Query;
	Query.SetParameter("Ref", Object.Ref);
	Query.Text =
	"SELECT
	|	ObjectsPrintTemplates.PrintTemplate
	|FROM
	|	InformationRegister.ObjectsPrintTemplates AS ObjectsPrintTemplates
	|WHERE
	|	ObjectsPrintTemplates.Object = &Ref";
	
	PrintTemplates.Clear();
	QuerySelection = Query.Execute().Select();
	While QuerySelection.Next() Do
		PrintTemplates.Add(QuerySelection.PrintTemplate);
	EndDo;

EndProcedure

&AtServer
Procedure OnWriteAtServer(Cancel, CurrentObject, WriteParameters)

	ObjectRecords = InformationRegisters.ObjectsPrintTemplates.CreateRecordSet();
	ObjectRecords.Filter.Object.Set(CurrentObject.Ref, True);
	
	For Each PrintTemplateItem In PrintTemplates Do
		Record = ObjectRecords.Add();
		Record.Object = CurrentObject.Ref;
		Record.PrintTemplate = PrintTemplateItem.Value;
	EndDo;
	
	ObjectRecords.Write(True);

EndProcedure

#Region COMMANDS

&AtClient
Procedure GeneratedFormCommandActionByName(Command) Export
	ExternalCommandsClient.GeneratedFormCommandActionByName(Object, ThisObject, Command.Name);
	GeneratedFormCommandActionByNameServer(Command.Name);
EndProcedure

&AtServer
Procedure GeneratedFormCommandActionByNameServer(CommandName) Export
	ExternalCommandsServer.GeneratedFormCommandActionByName(Object, ThisObject, CommandName);
EndProcedure

&AtClient
Procedure InternalCommandAction(Command) Export
	InternalCommandsClient.RunCommandAction(Command, ThisObject, Object, Object.Ref);
EndProcedure

&AtClient
Procedure InternalCommandActionWithServerContext(Command) Export
	InternalCommandActionWithServerContextAtServer(Command.Name);
EndProcedure

&AtServer
Procedure InternalCommandActionWithServerContextAtServer(CommandName)
	InternalCommandsServer.RunCommandAction(CommandName, ThisObject, Object, Object.Ref);
EndProcedure

#EndRegion
